{
    "Auto": {
      "sup_title": "From growing to coding...",
      "title": "Automation",
      "summary": "Python programming makes automation possible from GIS geoprocessing to greenhouse optimization.",
      "img_href": "./GIS/automation-workflow.jpg",
      "content": [
        {"type":"p","embed":"Agricultural technology should be built with farmers' skills in mind rather than trying to replace them. "},
        {"type":"list", "embed":[
            {"icon":"","item":"Maximize Best Conditions","desc": "In food production, no amount of technology will replace best growing practices.  It is a great assisting tool in reaching optimized conditions." },
            {"icon":"","item":"Flexibility & Customization","desc": "Automatic customization is great for well proven processes. But working with life is unpredictable and farmers need to have full manual control." },
            {"icon":"","item":"Ownership and privacy of data","desc": "Why should the I.T. service providers also have their hands on a grower's hard earned data and statistics?" }
            ]}
      ]
    },

    "Visual": {
        "sup_title": "The fabrics of I.T.",
        "title": "Visualization",
        "summary": "Every projects start with a vision for the visuals and chances are the design will still be touched up on long after all modules are deployed.  Needless to say, frontend development is one of the most essential aspect of information technologies.",
        "img_href": "./GIS/GEOS457-A1.jpg",
        "content": [     
              {"type":"list", "embed":[
              {"icon":"","item":"ArcGIS Pro","desc":"Great cartographic capapilities"},
              {"icon":"","item":"Figma & Illustrator","desc":"Putting together working templates will save significant cost in development later and make easier the client/specialist back and forth."},
              {"icon":"","item":"React/Next.js","desc":"Modern Web saves precious resources and contributes to a more optimized experience for all."}
              ]},
              {"type":"sub_title","embed":"Cartography Tutorial"},
          {"type":"p","embed":"Check out the challenges overcome in the cartography class:"},
          {"type":"a","embed":"www.codemara.com/GIS/PDF/Desmarais_Noemi_GEOS457_Tutorial_1.pdf"},
          {"type":"a","embed":"www.codemara.com/GIS/PDF/Desmarais_Noemi_GEOS457_Tutorial_3.pdf"},
          {"type":"a","embed":"www.codemara.com/GIS/PDF/Desmarais_Noemi_GEOS457_Tutorial_4.pdf"},
          {"type":"a","embed":"www.codemara.com/GIS/PDF/Desmarais_Noemi_GEOS457_Tutorial_6.pdf"},
          {"type":"a","embed":"www.codemara.com/GIS/PDF/Desmarais_Noemi_GEOS457_Tutorial_7.pdf"},
          {"type":"a","embed":"www.codemara.com/GIS/PDF/Desmarais_Noemi_GEOS457_Tutorial_1.pdf"}
        ]
      },

      "DataC": {
        "sup_title": "The Quest for excellent datasets",
        "title": "Data Capture",
        "summary": "Good Data Capture and Management are the backbones of any grand GIS or I.T. project",
        "img_href": "./GIS/GEOS451-A3.jpg",
        "content": [
          {"type":"list", "embed":[
              {"icon":"","item":"SQL/NoSQL Databases","desc":"..."},
              {"icon":"","item":"Aerial Imagery","desc":"..."},
              {"icon":"","item":"Digitization and mobile collection","desc":"..."}
              ]}
        ]
      },

      "Analysis": {
        "sup_title": "Telling stories",
        "title": "Spatial Analysis",
        "summary": "As complex as humanity itself, marketing goes beyond the digital world. Strategies must consider many facets of any given business.",
        "img_href": "./GIS/GEOS419-Final.jpg",
        "content": [
          {"type":"p","embed":"Nowadays, an integrated marketing strategies include digital products.  There is no one fit solution model and context and content matters above all."},
          {"type":"list", "embed":[
              {"icon":"","item":"Content writing","desc":"Artificial intelligence is a great general content writing tool but nothing replaces expertise and human reflexions to give the most relevant information."},
              {"icon":"","item":"SEO & Geotargeting","desc":"Search engines are the most useful tools to reach an audience with a need but competition is fierce.  Having a well optimized and referenced Website coupled with a local strategy will go a long way."}
              ]}
        ]
      },

      "Deve": {
        "sup_title": "Closer to the user",
        "title": "Development",
        "summary": "A good addition to a digital strategy, mobile applications and web development allow businesses to stay in the reach of their users at all time.",
        "img_href": "./built.png",
        "content": [
          {"type":"p","embed":"Mobile development is an exciting market with so much opportunities.  It is a new skill for me but I am committed to push it to its full potential with every new projects that comes my way."},
          {"type":"list", "embed":[
              {"icon":"","item":"Android apps","desc":"Android phones are 70% of the global market.  My first mobile apps were built with Java for Android SDK."},
              {"icon":"","item":"Iphone Apps","desc":"Iphones are almost 60% of the U.S. market. I am yet to take on the challenge of developing for the Apple Store but I can develop for cross-platform in React Native."},
              {"icon":"","item":"Node.js","desc":"Has become the favorite standard to support content-driven website and applications.  It allows to run JavaScript on servers and possibilites are wide and wild."},
              {"icon":"","item":"Microservices/REST API","desc":"To share data accross different domains, pages, applications and more"},
              {"icon":"","item":"Java/Spring","desc":"Still a robust solutions for complex applications such as back offices and more"}
              ]}, 
          {"type":"p","embed":"I have a strong capacity to learn programming languages very fast.  It is only a matter of time until I dive into Swift and Kotlin or into frameworks like Unity."}
        ]
      },

      "Market": {
        "sup_title": "Uniting data and results",
        "title": "Marketing",
        "summary": "I take care of the means but what truly matters is always the result.",
        "img_href": "./beams.jpg",
        "content": [
          {"type":"p","embed":"Synthesis is my nature.  My curious endless seeking mind and my wide variety of life experience has given me what it takes to integrate concepts, data and media into results."},
          {"type":"list", "embed":[
              {"icon":"","item":"SQL/NoSQL Databases","desc":"Structuring data is the key to get the most results out of them."},
              {"icon":"","item":"APIs","desc":"APIs are so great to share data across domains and extend services to users in the most portable way."}
              ]}
        ]
      }
}